<?php

return array(

    'Добавление' => [

        'Нового пользователя' => [
            'Таблица'   => 'users',
            'Передачи'  => array(
                'nickname'    => ':nickname',
                'password'    => ':password',
                'name'        => ':name',
                'family_name' => ':family_name',
                'email'       => ':email',
            )
        ],

        'Нового запуска из консоли' => [
            'Таблица'   => 'requests_console',
            'Передачи'  => array(
                'date'       => ':date',
                'request'    => ':request',
                'parameters' => ':parameters',
            )
        ],

    ],

    'Количество' => [

        'Всех пользователей' => [
            'Таблица'   => 'users',
            'Уточнение' => array()
        ],

    ],

    'Получение'  => [

        'Всех пользователей' => [
            'Таблица'     => 'users',
            'Получение'   => '*',
            'Уточнение'   => array(),
            'Сортировка'  => array('nickname' => 'asc'),
            'Позиция'     => false,
            'Количество'  => false
        ],

        'Id пользователя по авторизационым данным' => [
            'Таблица'     => 'users',
            'Получение'   => array('id'),
            'Уточнение'   => array(['nickname', '=' , ':nickname'], 'and', ['password', '=' , ':password']),
            'Сортировка'  => false,
            'Позиция'     => false,
            'Количество'  => 1
        ],

        'Id пользователя по псевдониму' => [
            'Таблица'     => 'users',
            'Получение'   => array('id'),
            'Уточнение'   => array(['nickname', '=' , ':nickname']),
            'Сортировка'  => false,
            'Позиция'     => false,
            'Количество'  => 1
        ],

        'Информации о пользователе по сессии' => [
            'Таблица'     => 'users',
            'Получение'   => '*',
            'Уточнение'   => array(['id' , '=' , ':id'], 'and', ['session', '=' , ':session']),
            'Сортировка'  => false,
            'Позиция'     => false,
            'Количество'  => 1
        ],

        'Id пользователя по электронному адресу' => [
            'Таблица'     => 'users',
            'Получение'   => array('id'),
            'Уточнение'   => array(['email', '=' , ':email']),
            'Сортировка'  => false,
            'Позиция'     => false,
            'Количество'  => 1
        ],

        'Информации о запуске из консоли по id' => [
            'Таблица'     => 'requests_console',
            'Получение'   => '*',
            'Уточнение'   => array(['id' , '=' , ':id']),
            'Сортировка'  => false,
            'Позиция'     => false,
            'Количество'  => 1
        ],

    ],

    'Изменение'  => [

        'Роли администрирования у пользователя' => [
            'Таблица'     => 'users',
            'Передачи'    => array('is_admin' => ':is_admin'),
            'Уточнение'   => array(['id', '=' , ':id']),
            'Количество'  => 1
        ],

        'Сессии у пользователя'                 => [
            'Таблица'     => 'users',
            'Передачи'    => array('session' => ':session'),
            'Уточнение'   => array(['id', '=' , ':id']),
            'Количество'  => 1
        ],

        'Статуса запуска консоли'               => [
            'Таблица'     => 'requests_console',
            'Передачи'    => array('status' => ':status'),
            'Уточнение'   => array(['id', '=' , ':id']),
            'Количество'  => 1
        ],

    ],

    'Удаление'   => [

    ]

);

?>