<?php

/* Схема взаимодействия с базой данных */
return array(

    'Добавление' => [

        'Нового пользователя' => [
            'Таблица'   => 'users',
            'Установки' => array(
                'nickname'    => '{Из массива}',
                'password'    => '{Из массива}',
                'name'        => '{Из массива}',
                'family_name' => '{Из массива}',
                'email'       => '{Из массива}',
            )
        ],

        'Нового запуска из консоли' => [
            'Таблица'   => 'requests_console',
            'Установки' => array(
                'date'       => '{Из массива}',
                'request'    => '{Из массива}',
                'parameters' => '{Из массива}',
            )
        ],

    ],

    'Количество' => [

        'Всех пользователей' => [
            'Таблица'   => 'users',
            'Уточнение' => array()
        ],

    ],

    'Получение'  => [

        'Всех пользователей' => [
            'Таблица'     => 'users',
            'Получение'   => '*',
            'Уточнение'   => array(),
            'Сортировка'  => array(
                'nickname' => 'asc'
            ),
            'Ограничение' => array()
        ],

        'Id пользователя по авторизационым данным' => [
            'Таблица'     => 'users',
            'Получение'   => array(
                'id'
            ),
            'Уточнение'   => array(
                ['nickname', '=' , '{Из массива}'],
                'and',
                ['password', '=' , '{Из массива}']
            ),
            'Сортировка'  => array(),
            'Ограничение' => array( 0, 1 )
        ],

        'Id пользователя по псевдониму' => [
            'Таблица'     => 'users',
            'Получение'   => array(
                'id'
            ),
            'Уточнение'   => array(
                ['nickname', '=' , '{Из массива}']
            ),
            'Сортировка'  => array(),
            'Ограничение' => array( 0, 1 )
        ],

        'Информации о пользователе по сессии' => [
            'Таблица'     => 'users',
            'Получение'   => '*',
            'Уточнение'   => array(
                ['id' , '=' , '{Из массива}'],
                'and',
                ['session', '=' , '{Из массива}']
            ),
            'Сортировка'  => array(),
            'Ограничение' => array( 0, 1 )
        ],

        'Id пользователя по электронному адресу' => [
            'Таблица'     => 'users',
            'Получение'   => array(
                'id'
            ),
            'Уточнение'   => array(
                ['email', '=' , '{Из массива}']
            ),
            'Сортировка'  => array(),
            'Ограничение' => array()
        ],

        'Информации о запуске из консоли по id' => [
            'Таблица'     => 'requests_console',
            'Получение'   => '*',
            'Уточнение'   => array(
                ['id' , '=' , '{Из массива}']
            ),
            'Сортировка'  => array(),
            'Ограничение' => array( 0, 1 )
        ],

    ],

    'Изменение'  => [

        'Роли администрирования у пользователя' => [
            'Таблица'     => 'users',
            'Установки'   => array(
                'is_admin' => '{Из массива}'
            ),
            'Уточнение'   => array(
                ['id', '=' , '{Из массива}']
            ),
            'Ограничение' => array( 0, 1 )
        ],

        'Сессии у пользователя'                 => [
            'Таблица'     => 'users',
            'Установки'   => array(
                'session' => '{Из массива}'
            ),
            'Уточнение'   => array(
                ['id', '=' , '{Из массива}']
            ),
            'Ограничение' => array( 0, 1 )
        ],

        'Статуса запуска консоли'               => [
            'Таблица'     => 'requests_console',
            'Установки'   => array(
                'status' => '{Из массива}'
            ),
            'Уточнение'   => array(
                ['id', '=' , '{Из массива}']
            ),
            'Ограничение' => array( 0, 1 )
        ],

    ],

    'Удаление'   => [

    ]

);

?>